app/controllers/logins_controller.rb

  def create
    user = User.find_by name: params[:session][:name].downcase
---
SELECT  `users`.* FROM `users` WHERE `users`.`name` = 'dong2021996' LIMIT 1