app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `phone`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('nguyen nngoc dong', '0984511627', 'nguyenngocdongfa@gmail.com', '2017-12-17 16:36:58', '2017-12-17 16:36:58', '$2a$10$P3tzvf8D8sgscpCJ.1vBP.EYI/KHmt/D2rwc/XYzND53exIPfdwJy')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save